# ExternalResourceServiceUtils Methods

---
The ExternalResourceServiceUtils type exposes the following members.
| Name| Description
---|---|---
| GetServersByType|  Gets registered external resource servers which support the external resource type.
Top
#### Reference
ExternalResourceServiceUtils Class
Autodesk.Revit.DB Namespace